app/controllers/personnels_controller.rb

SELECT "personnels".* FROM "personnels"
---
  def index
    @personnel = []
    @alumni = []
    Personnel.all.each do |personnel|