app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (EXTRACT(year from sort_date) = 2024) ORDER BY sort_date DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
---
  def index
    @posts = Post.where("EXTRACT(year from sort_date) = ?", Time.current.year)
                 .paginate(page: params[:page], per_page: 5)
                 .order('sort_date DESC')

SELECT "posts".* FROM "posts" ORDER BY sort_date DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
---
  def default
    @posts = Post.paginate(page: params[:page], per_page: 5)
                 .order('sort_date DESC')

SELECT "posts".* FROM "posts" WHERE (EXTRACT(year from sort_date) = '2016') ORDER BY sort_date DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
---
  def posts_by_year
    @posts = Post.where("EXTRACT(year from sort_date) = ?", params[:year])
                 .paginate(page: params[:page], per_page: 5)
                 .order('sort_date DESC')