app/controllers/publications_controller.rb

SELECT "publications".* FROM "publications" ORDER BY sort_date DESC LIMIT ? OFFSET ?  [["LIMIT", 11], ["OFFSET", 0]]
SELECT COUNT(*) FROM "publications"
---
  def index
    @publications = Publication.paginate(page: params[:page], per_page: 11).order('sort_date DESC')