app/controllers/static_pages_controller.rb

SELECT "activity_logs".* FROM "activity_logs" ORDER BY created_at DESC
SELECT SUM("activity_logs"."number_of_steps") FROM "activity_logs"
---
  def brainfreeze2022
    @activity_logs = ActivityLog.all.order('created_at DESC')
    @total_steps = ActivityLog.sum(:number_of_steps)